InDeviceMex/TM4C123/TM4C123_ApplicationLib/xDriver_MCU/DMA/Peripheral/Register/xHeader/DMA_RegisterPeripheral_Bitbanding.h
#define DMA_BITBANDING_USEBURSTCLR_CLR0    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR0_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR1    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR1_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR2    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR2_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR3    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR3_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR4    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR4_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR5    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR5_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR6    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR6_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR7    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR7_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR8    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR8_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR9    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR9_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR10    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR10_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR11    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR11_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR12    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR12_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR13    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR13_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR14    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR14_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR15    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR15_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR16    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR16_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR17    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR17_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR18    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR18_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR19    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR19_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR20    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR20_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR21    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR21_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR22    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR22_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR23    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR23_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR24    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR24_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR25    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR25_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR26    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR26_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR27    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR27_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR28    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR28_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR29    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR29_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR30    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR30_BIT * 4UL))))
#define DMA_BITBANDING_USEBURSTCLR_CLR31    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_USEBURSTCLR_OFFSET) * 32UL) + (DMA_USEBURSTCLR_R_CLR31_BIT * 4UL))))

/********************************************************************************************
************************************** 12 REQMASKSET **********************************************
********************************************************************************************/
#define DMA_BITBANDING_REQMASKSET    ((BITBANDING_DMASET_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_REQMASKSET_OFFSET) * 32UL)))

