InDeviceMex/TM4C123/TM4C123_ApplicationLib/xDriver_MCU/DMA/Peripheral/Register/xHeader/DMA_RegisterPeripheral_Bitbanding.h
#define DMA_BITBANDING_ENASET_SET0    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET0_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET1    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET1_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET2    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET2_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET3    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET3_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET4    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET4_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET5    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET5_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET6    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET6_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET7    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET7_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET8    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET8_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET9    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET9_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET10    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET10_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET11    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET11_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET12    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET12_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET13    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET13_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET14    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET14_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET15    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET15_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET16    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET16_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET17    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET17_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET18    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET18_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET19    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET19_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET20    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET20_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET21    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET21_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET22    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET22_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET23    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET23_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET24    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET24_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET25    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET25_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET26    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET26_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET27    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET27_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET28    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET28_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET29    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET29_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET30    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET30_BIT * 4UL))))
#define DMA_BITBANDING_ENASET_SET31    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENASET_OFFSET) * 32UL) + (DMA_ENASET_R_SET31_BIT * 4UL))))

/********************************************************************************************
************************************** 15 ENACLR **********************************************
********************************************************************************************/
#define DMA_BITBANDING_ENACLR    ((BITBANDING_DMACLR_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL)))

#define DMA_BITBANDING_ENACLR_CLR0    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR0_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR1    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR1_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR2    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR2_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR3    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR3_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR4    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR4_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR5    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR5_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR6    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR6_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR7    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR7_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR8    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR8_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR9    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR9_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR10    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR10_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR11    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR11_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR12    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR12_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR13    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR13_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR14    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR14_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR15    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR15_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR16    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR16_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR17    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR17_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR18    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR18_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR19    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR19_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR20    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR20_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR21    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR21_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR22    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR22_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR23    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR23_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR24    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR24_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR25    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR25_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR26    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR26_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR27    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR27_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR28    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR28_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR29    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR29_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR30    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR30_BIT * 4UL))))
#define DMA_BITBANDING_ENACLR_CLR31    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ENACLR_OFFSET) * 32UL) + (DMA_ENACLR_R_CLR31_BIT * 4UL))))

/********************************************************************************************
************************************** 16 ALTSET **********************************************
********************************************************************************************/
#define DMA_BITBANDING_ALTSET    ((BITBANDING_DMASET_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL)))

#define DMA_BITBANDING_ALTSET_SET0    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET0_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET1    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET1_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET2    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET2_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET3    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET3_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET4    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET4_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET5    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET5_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET6    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET6_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET7    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET7_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET8    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET8_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET9    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET9_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET10    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET10_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET11    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET11_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET12    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET12_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET13    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET13_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET14    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET14_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET15    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET15_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET16    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET16_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET17    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET17_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET18    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET18_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET19    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET19_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET20    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET20_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET21    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET21_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET22    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET22_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET23    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET23_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET24    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET24_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET25    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET25_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET26    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET26_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET27    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET27_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET28    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET28_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET29    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET29_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET30    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET30_BIT * 4UL))))
#define DMA_BITBANDING_ALTSET_SET31    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTSET_OFFSET) * 32UL) + (DMA_ALTSET_R_SET31_BIT * 4UL))))

/********************************************************************************************
************************************** 17 ALTCLR **********************************************
********************************************************************************************/
#define DMA_BITBANDING_ALTCLR    ((BITBANDING_DMACLR_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL)))

#define DMA_BITBANDING_ALTCLR_CLR0    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR0_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR1    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR1_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR2    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR2_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR3    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR3_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR4    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR4_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR5    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR5_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR6    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR6_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR7    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR7_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR8    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR8_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR9    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR9_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR10    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR10_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR11    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR11_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR12    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR12_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR13    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR13_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR14    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR14_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR15    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR15_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR16    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR16_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR17    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR17_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR18    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR18_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR19    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR19_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR20    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR20_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR21    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR21_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR22    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR22_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR23    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR23_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR24    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR24_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR25    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR25_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR26    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR26_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR27    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR27_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR28    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR28_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR29    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR29_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR30    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR30_BIT * 4UL))))
#define DMA_BITBANDING_ALTCLR_CLR31    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTCLR_OFFSET) * 32UL) + (DMA_ALTCLR_R_CLR31_BIT * 4UL))))

/********************************************************************************************
************************************* 18 PRIOSET **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PRIOSET    ((BITBANDING_DMASET_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL)))

