InDeviceMex/TM4C123/TM4C123_ApplicationLib/xDriver_MCU/DMA/Peripheral/Register/xHeader/DMA_RegisterPeripheral_Bitbanding.h
#define DMA_BITBANDING_PRIOSET_SET0    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET0_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET1    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET1_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET2    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET2_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET3    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET3_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET4    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET4_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET5    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET5_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET6    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET6_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET7    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET7_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET8    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET8_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET9    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET9_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET10    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET10_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET11    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET11_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET12    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET12_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET13    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET13_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET14    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET14_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET15    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET15_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET16    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET16_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET17    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET17_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET18    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET18_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET19    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET19_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET20    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET20_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET21    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET21_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET22    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET22_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET23    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET23_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET24    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET24_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET25    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET25_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET26    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET26_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET27    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET27_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET28    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET28_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET29    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET29_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET30    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET30_BIT * 4UL))))
#define DMA_BITBANDING_PRIOSET_SET31    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOSET_OFFSET) * 32UL) + (DMA_PRIOSET_R_SET31_BIT * 4UL))))

/********************************************************************************************
************************************** 19 PRIOCLR **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PRIOCLR    ((BITBANDING_DMACLR_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL)))

#define DMA_BITBANDING_PRIOCLR_CLR0    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR0_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR1    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR1_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR2    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR2_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR3    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR3_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR4    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR4_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR5    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR5_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR6    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR6_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR7    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR7_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR8    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR8_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR9    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR9_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR10    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR10_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR11    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR11_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR12    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR12_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR13    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR13_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR14    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR14_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR15    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR15_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR16    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR16_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR17    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR17_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR18    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR18_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR19    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR19_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR20    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR20_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR21    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR21_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR22    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR22_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR23    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR23_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR24    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR24_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR25    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR25_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR26    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR26_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR27    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR27_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR28    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR28_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR29    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR29_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR30    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR30_BIT * 4UL))))
#define DMA_BITBANDING_PRIOCLR_CLR31    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PRIOCLR_OFFSET) * 32UL) + (DMA_PRIOCLR_R_CLR31_BIT * 4UL))))

/********************************************************************************************
************************************** 20 ERRCLR **********************************************
********************************************************************************************/
#define DMA_BITBANDING_ERRCLR    ((BITBANDING_DMAERRCLR_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ERRCLR_OFFSET) * 32UL)))

#define DMA_BITBANDING_ERRCLR_ERRCLR    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ERRCLR_OFFSET) * 32UL) + (DMA_ERRCLR_R_ERRCLR_BIT * 4UL))))

/********************************************************************************************
************************************** 21 CHASGN **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CHASGN    ((BITBANDING_DMACHASGN_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL)))

#define DMA_BITBANDING_CHASGN_CHASGN0    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN0_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN1    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN1_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN2    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN2_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN3    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN3_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN4    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN4_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN5    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN5_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN6    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN6_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN7    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN7_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN8    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN8_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN9    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN9_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN10    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN10_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN11    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN11_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN12    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN12_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN13    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN13_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN14    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN14_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN15    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN15_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN16    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN16_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN17    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN17_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN18    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN18_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN19    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN19_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN20    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN20_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN21    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN21_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN22    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN22_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN23    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN23_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN24    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN24_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN25    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN25_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN26    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN26_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN27    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN27_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN28    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN28_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN29    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN29_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN30    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN30_BIT * 4UL))))
#define DMA_BITBANDING_CHASGN_CHASGN31    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHASGN_OFFSET) * 32UL) + (DMA_CHASGN_R_CHASGN31_BIT * 4UL))))

/********************************************************************************************
************************************** 22 CHIS **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CHIS    ((BITBANDING_DMACHIS_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL)))

#define DMA_BITBANDING_CHIS_CHIS0    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS0_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS1    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS1_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS2    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS2_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS3    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS3_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS4    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS4_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS5    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS5_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS6    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS6_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS7    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS7_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS8    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS8_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS9    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS9_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS10    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS10_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS11    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS11_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS12    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS12_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS13    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS13_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS14    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS14_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS15    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS15_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS16    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS16_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS17    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS17_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS18    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS18_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS19    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS19_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS20    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS20_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS21    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS21_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS22    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS22_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS23    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS23_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS24    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS24_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS25    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS25_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS26    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS26_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS27    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS27_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS28    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS28_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS29    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS29_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS30    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS30_BIT * 4UL))))
#define DMA_BITBANDING_CHIS_CHIS31    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHIS_OFFSET) * 32UL) + (DMA_CHIS_R_CHIS31_BIT * 4UL))))

/********************************************************************************************
************************************** 23 CHMAP0 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CHMAP0    ((BITBANDING_DMACHMAP0_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHMAP0_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 24 CHMAP1 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CHMAP1    ((BITBANDING_DMACHMAP1_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHMAP1_OFFSET) * 32UL)))

