InDeviceMex/TM4C123/TM4C123_ApplicationLib/xDriver_MCU/DMA/Peripheral/Register/xHeader/DMA_RegisterPeripheral_Bitbanding.h
/********************************************************************************************
************************************** 25 CHMAP2 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CHMAP2    ((BITBANDING_DMACHMAP2_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHMAP2_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 26 CHMAP3 *********************************************
********************************************************************************************/
#define DMA_BITBANDING_CHMAP3    ((BITBANDING_DMACHMAP3_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CHMAP3_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 27 PeriphID0 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PeriphID0    ((BITBANDING_DMAPeriphID0_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PeriphID0_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 28 PeriphID1 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PeriphID1    ((BITBANDING_DMAPeriphID1_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PeriphID1_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 29 PeriphID2 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PeriphID2    ((BITBANDING_DMAPeriphID2_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PeriphID2_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 30 PeriphID3 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PeriphID3    ((BITBANDING_DMAPeriphID3_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PeriphID3_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 31 PeriphID4 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PeriphID4    ((BITBANDING_DMAPeriphID4_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PeriphID4_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 32 PCellID0 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PCellID0    ((BITBANDING_DMAPCellID0_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PCellID0_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 33 PCellID1 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PCellID1    ((BITBANDING_DMAPCellID1_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PCellID1_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 34 PCellID2 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PCellID2    ((BITBANDING_DMAPCellID2_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PCellID2_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 35 PCellID3 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PCellID3    ((BITBANDING_DMAPCellID3_TypeDef*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PCellID3_OFFSET) * 32UL)))

#endif /* XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERPERIPHERAL_BITBANDING_H_ */
